# CurtainGrids Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExtrusionRoof..::..CurtainGrids Property
ExtrusionRoof Class See Also
---
Retrieve all the CurtainGrid objects of a curtain Roof.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurtainGridSet CurtainGrids { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurtainGrids As CurtainGridSet
	Get
```

Visual C++
---
```text
public:
property CurtainGridSet^ CurtainGrids {
	CurtainGridSet^ get ();
}
```

# Remarks
Only when the object is a CurtainRoof, this property makes sense.
# See Also
ExtrusionRoof Class
Autodesk.Revit.DB Namespace